
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ЭлементНачало = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("НачалоТекущегоМесяца"));
	ЭлементНачало.Значение = НачалоМесяца(ТекущаяДатаСеанса());
	ЭлементНачало.Использование = Истина;

	ЭлементКонец = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("КонецТекущегоМесяца"));
	ЭлементКонец.Значение = КонецМесяца(ТекущаяДатаСеанса());
	ЭлементКонец.Использование = Истина;

	ЭлементНоменклатура = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("НоменклатураРаботыСпециалиста"));
	ЭлементНоменклатура.Значение = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	ЭлементНоменклатура.Использование = Истина;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
