
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет табличную часть выплат неоплаченными остатками взаиморасчётов с сотрудниками на дату документа.
Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт

	ВКМ_Выплаты.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.ВКМ_Сотрудник КАК Сотрудник,
	|	Остатки.ВКМ_СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&НаДату) КАК Остатки
	|ГДЕ
	|	Остатки.ВКМ_СуммаОстаток > 0";
	Запрос.УстановитьПараметр("НаДату", Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ВКМ_Выплаты.Добавить();
		НоваяСтрока.ВКМ_Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВКМ_Сумма = Выборка.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Для Каждого СтрокаВыплаты Из ВКМ_Выплаты Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = СтрокаВыплаты.ВКМ_Сотрудник;
		Движение.ВКМ_Сумма = СтрокаВыплаты.ВКМ_Сумма;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
