
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	СтавкаНДФЛ = 0.13;

	Для Каждого СтрокаСписка Из ВКМ_СписокСотрудников Цикл

		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеПремия.ПериодРегистрации = НачалоДня(Дата);
		ДвижениеПремия.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия");
		ДвижениеПремия.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеПремия.ВКМ_Результат = СтрокаСписка.ВКМ_СуммаПремии;

		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = НачалоДня(Дата);
		ДвижениеНДФЛ.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ");
		ДвижениеНДФЛ.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеНДФЛ.ВКМ_Результат = СтрокаСписка.ВКМ_СуммаПремии * СтавкаНДФЛ;

		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Период = НачалоДня(Дата);
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = ДвижениеПремия.ВКМ_Результат - ДвижениеНДФЛ.ВКМ_Результат;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
