
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВКМ_УстановитьВидимостьАбонентскогоОбслуживания();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)

	ВКМ_УстановитьВидимостьАбонентскогоОбслуживания();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_УстановитьВидимостьАбонентскогоОбслуживания()

	Элементы.ВКМ_ГруппаАбонентскогоОбслуживания.Видимость =
		Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");

КонецПроцедуры

#КонецОбласти
